Tekla Open API Reference for Tekla Structures 2025
AnalysisResult.ValueTypeEnum Enumeration
 The value type.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ValueTypeEnum
Public Enumeration ValueTypeEnum
Members
Member name | Value | Description
VALUETYPE_AXIAL | 1 |  The axial (FX) (N) value type.
VALUETYPE_SHEAR_Y | 2 |  The shear Y (FY) (N) value type.
VALUETYPE_SHEAR_Z | 3 |  The shear Z (FZ) (N) value type.
VALUETYPE_TORSION_MOMENT | 4 |  The torsion moment (MX) (Nm) value type.
VALUETYPE_MOMENT_Y | 5 |  The bending moment Y (MY) (Nm) value type.
VALUETYPE_MOMENT_Z | 6 |  The bending moment Z (MZ) (Nm) value type.
VALUETYPE_SHEAR_YZ | 51 |  The shear resultant (positive) (N) value type.
VALUETYPE_MOMENT_YZ | 52 |  The moment resultant (positive) (Nm) value type.
VALUETYPE_ECC_MOMENT_Y | 53 |  The eccentricity moment Y (Nm) value type.
VALUETYPE_ECC_MOMENT_Z | 54 |  The eccentricity moment Z (Nm) value type.
VALUETYPE_STEEL_UTILITY_RATIO | 101 |  The utility ratio value type.
VALUETYPE_GLOBAL_REACTION_X | 201 |  The reaction in global X (N) value type.
VALUETYPE_GLOBAL_REACTION_Y | 202 |  The reaction in global Y (N) value type.
VALUETYPE_GLOBAL_REACTION_Z | 203 |  The reaction in global Z (N) value type.
VALUETYPE_DISPLACEMENT_X | 301 |  The displacement in global X (mm) value type.
VALUETYPE_DISPLACEMENT_Y | 302 |  The displacement in global Y (mm) value type.
VALUETYPE_DISPLACEMENT_Z | 303 |  The displacement in global Z (mm) value type.
VALUETYPE_ROTATION_X | 304 |  The rotation around global X (rad) value type.
VALUETYPE_ROTATION_Y | 305 |  The rotation around global Y (rad) value type.
VALUETYPE_ROTATION_Z | 306 |  The rotation around global Z (rad) value type.
VALUETYPE_REINFORCEMENT_AREA | 400 |  The reinforcement area (total) (mm2) value type.
VALUETYPE_REINFORCEMENT_BOTTOM | 401 |  The bottom reinforcement area (mm2) value type.
VALUETYPE_REINFORCEMENT_TOP | 402 |  The top reinforcement area (mm2) value type.
VALUETYPE_REINFORCEMENT_SHEAR | 403 |  The shear reinforcement area (mm2/m) value type.
VALUETYPE_SLAB_MAIN_DIRECTION_X | 421 |  The slab main direction cosine, X component, value type.
VALUETYPE_SLAB_MAIN_DIRECTION_Y | 422 |  The slab main direction cosine, Y component, value type.
VALUETYPE_SLAB_MAIN_DIRECTION_Z | 423 |  The slab main direction cosine, Z component, value type.
VALUETYPE_SLAB_SECONDARY_DIRECTION_X | 424 |  The slab secondary direction cosine, X component, value type.
VALUETYPE_SLAB_SECONDARY_MAIN_DIRECTION_Y | 425 |  The slab secondary direction cosine, Y component, value type.
VALUETYPE_SLAB_SECONDARY_MAIN_DIRECTION_Z | 426 |  The slab secondary direction cosine, Z component, value type.
VALUETYPE_SLAB_MAIN_REINFORCEMENT_BOTTOM | 427 |  The slab main reinforcement, bottom (mm2/m), value type.
VALUETYPE_SLAB_MAIN_REINFORCEMENT_TOP | 428 |  The slab main reinforcement, top (mm2/m), value type.
VALUETYPE_SLAB_SEC_REINFORCEMENT_BOTTOM | 429 |  The slab secondary reinforcement, bottom (mm2/m), value type.
VALUETYPE_SLAB_SEC_REINFORCEMENT_TOP | 430 |  The slab secondary reinforcement, top (mm2/m), value type.
VALUETYPE_SLAB_SHEAR_REINFORCEMENT | 431 |  The slab shear reinforcement (mm2/m) value type.
VALUETYPE_AXIAL_MINUS | 11 |  The axial (FX), minus side (N), value type.
VALUETYPE_SHEAR_Y_MINUS | 12 |  The shear Y (FY), minus side (N), value type.
VALUETYPE_SHEAR_Z_MINUS | 13 |  The shear Z (FZ), minus side (N), value type.
VALUETYPE_TORSION_MOMENT_MINUS | 14 |  The torsion moment (MX), minus side (Nm), value type.
VALUETYPE_MOMENT_Y_MINUS | 15 |  The bending moment Y (MY), minus side (Nm), value type.
VALUETYPE_MOMENT_Z_MINUS | 16 |  The bending moment Z (MZ), minus side (Nm), value type.
VALUETYPE_AXIAL_PLUS | 21 |  The axial (FX), plus side (N), value type.
VALUETYPE_SHEAR_Y_PLUS | 22 |  The shear Y (FY), plus side (N), value type.
VALUETYPE_SHEAR_Z_PLUS | 23 |  The shear Z (FZ), plus side (N), value type.
VALUETYPE_TORSION_MOMENT_PLUS | 24 |  The torsion moment (MX), plus side (Nm), value type.
VALUETYPE_MOMENT_Y_PLUS | 25 |  The bending moment Y (MY), plus side (Nm), value type.
VALUETYPE_MOMENT_Z_PLUS | 26 |  The bending moment Z (MZ), plus side (Nm), value type.
See Also
Reference
Tekla.Structures.Analysis Namespace